zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/src/timer_pwm.c
/**
  * @brief      Enable External Event Trigger Counter Action
  * @param[in]  timer               The pointer of the specified Timer module. It could be TIMER0, TIMER1, TIMER2, TIMER3.
  * @param[in]  u32ExtEventSrc      External event source selection.
  *                                 - \ref TPWM_EXT_TGR_PIN_INT0
  *                                 - \ref TPWM_EXT_TGR_PIN_INT1
  *                                 - \ref TPWM_EXT_TGR_PIN_INT2
  *                                 - \ref TPWM_EXT_TGR_PIN_INT3
  *                                 - \ref TPWM_EXT_TGR_PIN_INT4
  *                                 - \ref TPWM_EXT_TGR_PIN_INT5
  *                                 - \ref TPWM_EXT_TGR_PIN_INT6
  *                                 - \ref TPWM_EXT_TGR_PIN_INT7
  * @param[in]  u32CounterAction    Counter action selection.
  *                                 - \ref TPWM_EXT_TGR_COUNTER_RESET
  *                                 - \ref TPWM_EXT_TGR_COUNTER_START
  *                                 - \ref TPWM_EXT_TGR_COUNTER_RESET_AND_START
  * @return     None
  * @details    This function is used to enable external event to trigger the counter specified action.
  */
void TPWM_EnableExtEventTrigger(TIMER_T *timer, uint32_t u32ExtEventSrc, uint32_t u32CounterAction)
{
    timer->PWMEXTETCTL = (((timer)->PWMEXTETCTL & ~(TIMER_PWMEXTETCTL_EXTTRGS_Msk | TIMER_PWMEXTETCTL_CNTACTS_Msk))
                          | (TIMER_PWMEXTETCTL_EXTETEN_Msk | (u32ExtEventSrc << TIMER_PWMEXTETCTL_EXTTRGS_Pos) | (u32CounterAction << TIMER_PWMEXTETCTL_CNTACTS_Pos)));
}

/**
  * @brief      Disable External Event Trigger Counter Action
  * @param[in]  timer       The pointer of the specified Timer module. It could be TIMER0, TIMER1, TIMER2, TIMER3.
  * @return     None
  * @details    This function is used to disable external event to trigger counter action.
  */
void TPWM_DisableExtEventTrigger(TIMER_T *timer)
{
    timer->PWMEXTETCTL &= ~TIMER_PWMEXTETCTL_EXTETEN_Msk;
}

/** @} end of group TPWM_EXPORTED_FUNCTIONS */
/** @} end of group TPWM_Driver */
/** @} end of group Standard_Driver */
